/**
  *******************************************************************************************************
  * File Name: bsp_enconder.h
  * Author: Vector
  * Version: V1.0.0
  * Date: 2018-4-5
  * Brief: 本文件提供了有关电机编码器的相关操作函数的声明
  *******************************************************************************************************
  * History
  *		1.Author: Vector
	*			Date: 2018-4-5
	*			Mod: 建立文件
  *
  *******************************************************************************************************
  */	

# ifndef __BSP_ENCODER_H
# define __BSP_ENCODER_H




void bsp_encoder_Config(void);
void bsp_encoder_ReadValue(void);

# endif


/********************************************  END OF FILE  *******************************************/

